results/1/server1/yesod-core-1.4.7.2/PARAM.log
Benchmarking PARAM
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    41.68ms   28.46ms 906.18ms   99.56%
    Req/Sec     9.85k     2.45k   19.18k    75.59%
  582349 requests in 30.00s, 112.18MB read
  Socket errors: connect 0, read 0, write 0, timeout 188
Requests/sec:  19411.80
Transfer/sec:      3.74MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   141.77ms  294.54ms   1.04s    89.22%
    Req/Sec     9.90k     5.31k   24.44k    59.90%
  574279 requests in 30.00s, 110.63MB read
  Socket errors: connect 0, read 0, write 0, timeout 415
Requests/sec:  19142.12
Transfer/sec:      3.69MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    41.53ms   13.96ms 993.73ms   88.26%
    Req/Sec     9.86k     2.11k   14.00k    62.11%
  585873 requests in 30.00s, 112.86MB read
Requests/sec:  19527.19
Transfer/sec:      3.76MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   234.31ms  565.47ms   2.01s    89.36%
    Req/Sec     9.80k     5.15k   22.94k    59.47%
  568217 requests in 30.00s, 109.46MB read
  Socket errors: connect 0, read 0, write 0, timeout 441
Requests/sec:  18940.40
Transfer/sec:      3.65MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    86.11ms  208.80ms   1.21s    95.07%
    Req/Sec     9.99k     4.67k   20.47k    62.57%
  583973 requests in 30.00s, 112.50MB read
  Socket errors: connect 0, read 0, write 0, timeout 309
Requests/sec:  19465.66
Transfer/sec:      3.75MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   287.51ms  596.71ms   1.84s    85.25%
    Req/Sec    10.06k     5.92k   29.15k    59.20%
  581628 requests in 30.00s, 112.05MB read
  Socket errors: connect 0, read 0, write 0, timeout 115
Requests/sec:  19387.02
Transfer/sec:      3.73MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    42.02ms   23.60ms   1.59s    97.73%
    Req/Sec     9.68k     1.97k   16.36k    76.57%
  573680 requests in 30.00s, 110.51MB read
  Socket errors: connect 0, read 0, write 0, timeout 83
Requests/sec:  19121.81
Transfer/sec:      3.68MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   272.52ms  607.56ms   1.91s    87.14%
    Req/Sec    10.21k     5.75k   26.50k    60.55%
  588611 requests in 30.00s, 113.39MB read
  Socket errors: connect 0, read 0, write 0, timeout 169
Requests/sec:  19619.29
Transfer/sec:      3.78MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   211.59ms  387.22ms   1.23s    83.01%
    Req/Sec    10.06k     5.95k   27.75k    58.30%
  578504 requests in 30.00s, 111.44MB read
  Socket errors: connect 0, read 0, write 0, timeout 323
Requests/sec:  19283.09
Transfer/sec:      3.71MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    41.93ms   21.01ms 880.66ms   93.35%
    Req/Sec     9.67k     2.09k   16.93k    76.96%
  572547 requests in 30.00s, 110.30MB read
  Socket errors: connect 0, read 0, write 0, timeout 182
Requests/sec:  19084.10
Transfer/sec:      3.68MB
=================== summary ===================
machine:      server1
ghc version:  7.8.4
bench target: yesod-core-1.4.7.2
bench:        PARAM
bench mode:   30s * 10
average:      19298.25
stdev:        219.58
=================== oneline ===================
server1,7.8.4,yesod-core-1.4.7.2,PARAM,30s,10,19298.25,219.58